[
    {
        "id": 1,
        "project": "The Handcrafted Heirloom",
        "about":"For our final team project we created a custom website for a local business owner. We utilized ReactJs, MySQL, Cloudinary, and PayPal. The owner of the website has a login to maintain the gallery page using a modal. We hope this website will expand the owners clientele.",
        "src": "../UsedImgs/Handcrated-Heirloom.png",
        "alt": "Handcrafted Heirloom App",
        "depl": "https://shrouded-everglades-61786.herokuapp.com/",
        "git": "https://github.com/Krieffer21/Y.A.MAKER"
        },
    {
        "id": 2,
        "project": "Lyrics to Go",
        "about":"For our first project we used our newly acquired full-stack skills and knowledge to build a web application from scratch. Working collaboratively as a team, we have executed our design by integrating data received from multiple server-side API requests. Our web application, 'Lyrics to Go' is designed to provide the user with album artwork and lyrics based on the artist and song title they search for.",
        "src": "https://drive.google.com/uc?export=view&id=12uE9FKWz8Js_uUTNkMcmn0ojMbZ0txYz",
        "alt": "Lyrics to Go App",
        "depl": "https://krieffer21.github.io/Lyrics-To-Go/ ",
        "git": "https://github.com/Krieffer21/Lyrics-To-Go"
    },
    {
        "id": 3,
        "project": "Critical Hit ",
        "about":"The second team project required us to utilize Handlebars.js, backed by a MySQL database. Our application 'Critical Hit' is designed to provide the user with various characters that can be used for a role playing game, such as DnD or Pathfinder. After the user logs in they are given the option to select an existing character or to create a character.",
        "src": "../UsedImgs/hitLogo.png",
        "alt": "Critical Hit App",
        "depl": "https://critical-hit-fantasy-character.herokuapp.com/ ",
        "git": "https://github.com/Krieffer21/project-2"
    },
    {
        "id": 4,
        "project": "Weather App ",
        "about":"The weather application gives the current days weather along with the forecast for the next 5 days. The user is able to search for a city and see the weather results, and click on prior searches. The cities the user searches for are saved to local storage. I used the openweather api and moment.js, a time/ date library, to get the required information needed.",
        "src": "../UsedImgs/weather.png",
        "alt": "Weather App",
        "depl": "https://krieffer21.github.io/Krieffer_06HW_Weather/",
        "git": "https://github.com/Krieffer21/Krieffer_06HW_Weather"
    },
    {
        "id": 5,
        "project": "Coding Quiz ",
        "about":"This application is a timed coding quiz with multiple-choice questions. When a question is answered incorrectly time is subtracted from the timer, if a question is answered correctly they are given the next question. The quiz also features a high scores page so after they finish the quiz or run out of time the user can submit their high score.",
        "src": "../UsedImgs/codeQuiz.png",
        "alt": "Coding Quiz App",
        "depl": "https://krieffer21.github.io/Krieffer_04HW/",
        "git": "https://github.com/Krieffer21/Krieffer_04HW"

    },
    {
        "id": 6,
        "project": "Note Taker",
        "about":"This assignment was to write the backend code and connect it to the given front end code to create a note taker application. The completed application will allow the user to write a note, save it, and delete the selected note.",
        "src": "../UsedImgs/noteTaker.png",
        "alt": "Note Taker App",
        "depl": "https://morning-bastion-53699.herokuapp.com/notes",
        "git": "https://github.com/Krieffer21/Krieffer_noteTaker"
    },
    {
        "id": 7,
        "project": "Eat Da Burger!",
        "about":"This application emulates the example 'Eat Da Burger' application. It allows the user to enter a burger name and then click a button to 'Devour it!'. The burger logger was built with MySQL, Node, Express, Handlebars and a homemade ORM.",
        "src": "../UsedImgs/handlebarsburger.png",
        "alt": "Burger App",
        "depl": "https://shielded-bayou-55697.herokuapp.com/",
        "git": "https://github.com/Krieffer21/Krieffer_Handlebars"
    }
]